#task 1


str_1 = (int(input("введите байты: ")))
str_2 = str_1 * 8
print(f"в {str_1} байт, {str_2} бит.")


#task 2 не доделано(


print("Электронная книга по программированию на английком языке состоит из S страниц. \n""в среднем на странице C строк по N символов.\n""Используется кодировка кодировка UTF-8. Определите объем текстового файла в Килобайтах")

s = int(input("Введите кол-во страниц:"))
c = int(input("Введите кол-во строк на странице:"))
n = int(input("Введите кол-во символов на странице:"))
